/**
  ******************************************************************************
  * ÎÄ¼şÃû³Ì: main.c 
  * ×÷    Õß: Ó²Ê¯Ç¶ÈëÊ½¿ª·¢ÍÅ¶Ó
  * °æ    ±¾: V1.0
  * ±àĞ´ÈÕÆÚ: 2015-10-04
  * ¹¦    ÄÜ: Ê¹ÓÃ±ê×¼¿â·½·¨¿ØÖÆLEDµÆÁÁÃğ
  ******************************************************************************
  * ËµÃ÷£º
  * ±¾Àı³ÌÅäÌ×Ó²Ê¯stm32¿ª·¢°åYS-F1ProÊ¹ÓÃ¡£
  * 
  * ÌÔ±¦£º
  * ÂÛÌ³£ºhttp://www.ing10bbs.com
  * °æÈ¨¹éÓ²Ê¯Ç¶ÈëÊ½¿ª·¢ÍÅ¶ÓËùÓĞ£¬ÇëÎğÉÌÓÃ¡£
  ******************************************************************************
  */
/* °üº¬Í·ÎÄ¼ş ----------------------------------------------------------------*/
#include "stm32f10x.h"
#include "ausart.h"

/* Ë½ÓĞÀàĞÍ¶¨Òå --------------------------------------------------------------*/
/* Ë½ÓĞºê¶¨Òå ----------------------------------------------------------------*/
/* Ë½ÓĞ±äÁ¿ ------------------------------------------------------------------*/
/* À©Õ¹±äÁ¿ ------------------------------------------------------------------*/
/* Ë½ÓĞº¯ÊıÔ­ĞÎ --------------------------------------------------------------*/
void Delay(uint32_t t)
{
	while(t--);
}

/* º¯ÊıÌå --------------------------------------------------------------------*/

/**
  * º¯Êı¹¦ÄÜ: Ö÷º¯Êı.
  * ÊäÈë²ÎÊı: ÎŞ
  * ·µ »Ø Öµ: ÎŞ
  * Ëµ    Ã÷: ÎŞ
  */

uint8_t test[10] =  "testteste";
extern uint8_t recvData;
int main(void)
{  	

 	BSP_Init();

		VirtualCOM_Config(_4800BuadRate);             //??IO?????????600

	//	VirtualCOM_StringSend("HelloWorld!\r\n");   //??“HelloWorld!”???
		while(1)
		{
			//VirtualCOM_StringSend("HelloWorld!\r\n"); 
			//TIM_Cmd(TIM2, ENABLE);		//¶¨Ê±Æ÷·¢ËÍ²âÊÔ
//      VirtualCOM_ByteSend('A');
			VirtualCOM_ByteSend(recvData);
			Delay(5000000);

		}
}

/**
  * º¯Êı¹¦ÄÜ: ¼òµ¥´Ö±©µÄÑÓÊ±º¯Êı
  * ÊäÈë²ÎÊı: time£»ÑÓÊ±Ê±¼äÉèÖÃ
  * ·µ »Ø Öµ: ÎŞ
  * Ëµ    Ã÷£ºÊ¹ÓÃÕâÖÖËÀÑ­»··½Ê½µÄÑÓÊ±º¯ÊıÊÇÃ»°ì·¨¾«È·¿ØÖÆÑÓÊ±Ê±¼ä³¤¶Ì£¬
  *            Ö»ÊÇ´ó¸ÅµÄÑÓÊ±Ê±¼ä£¬ËùÒÔ»ù±¾ÉÏ¶¼ÊÇÍ¨¹ı²»¶ÏĞŞ¸ÄÊäÈë²ÎÊı
  *            ´óĞ¡È»ºóÏÂÔØµ½¿ª·¢°åÉÏ¿´ÊµÑéĞ§¹û¡£
  */
//static void Delay(uint32_t time)
//{
//  uint32_t i,j;

//  for(i=0;i<time;++i)
//  {
//    for(j=0;j<10000;++j)
//    {       
//      //¿ÕÑ­»·£¬Ê²Ã´¶¼²»×ö        
//    }
//  }
//}

/******************* (C) COPYRIGHT 2015-2020 Ó²Ê¯Ç¶ÈëÊ½¿ª·¢ÍÅ¶Ó *****END OF FILE****/

